app/controllers/mylessons_controller.rb

  def register

    @Mylesson= Mylesson.new(
      user_id:@current_user.id,
      lesson_id: params[:id]
    )
    @Mylesson.save
---
INSERT INTO `mylessons` (`user_id`, `lesson_id`, `created_at`, `updated_at`) VALUES (11, 5, '2021-06-09 04:42:01.307894', '2021-06-09 04:42:01.307894')

  def unregister
    @Mylesson= Mylesson.find_by(
      user_id:@current_user.id,
      lesson_id: params[:id]
    )
    @Mylesson.destroy
---
SELECT `mylessons`.* FROM `mylessons` WHERE `mylessons`.`user_id` = 2 AND `mylessons`.`lesson_id` = 7 LIMIT 1
DELETE FROM `mylessons` WHERE `mylessons`.`id` = 11

  def unregister_frommypage
    @Mylesson= Mylesson.find_by(
      user_id:@current_user.id,
      lesson_id: params[:id]
    )
    @Mylesson.destroy
---
SELECT `mylessons`.* FROM `mylessons` WHERE `mylessons`.`user_id` = 2 AND `mylessons`.`lesson_id` = 7 LIMIT 1
DELETE FROM `mylessons` WHERE `mylessons`.`id` = 11